## Binary Operations in Data Frames
The binary operator function could perform addition, subtraction and so on to return the new value. Pandas.DataFrame has several binary operator functions defined for combining two DataFrames. The binary operator functions return a new DataFrame as a result of combining the two DataFrames.

In [25]:
# importing libraries
import pandas as pd
import numpy as np

In [12]:
# defining data frames
df1 = pd.DataFrame([[2,3,5],[1,4,2],[2,7,5]])
df2 = pd.DataFrame([[3,2,5],[4,8,4],[1,6,7]])

In [13]:
df1

   0  1  2
0  2  3  5
1  1  4  2
2  2  7  5

In [14]:
df2

   0  1  2
0  3  2  5
1  4  8  4
2  1  6  7

In [15]:
# adding two dataframes
df1 + df2

   0   1   2
0  5   5  10
1  5  12   6
2  3  13  12

In [16]:
# subtracting two dataframes
df1 - df2

   0  1  2
0 -1  1  0
1 -3 -4 -2
2  1  1 -2

In [17]:
# multipliying two dataframes
df1 * df2

   0   1   2
0  6   6  25
1  4  32   8
2  2  42  35

In [18]:
# matrix multiplication
df1.dot(df2)

    0   1   2
0  23  58  57
1  21  46  35
2  39  90  73

In [19]:
# elementwise division
df1.div(df2)

          0         1         2
0  0.666667  1.500000  1.000000
1  0.250000  0.500000  0.500000
2  2.000000  1.166667  0.714286

In [20]:
# integer or floor division
# returns the quotient
df1.floordiv(df2)

   0  1  2
0  0  1  1
1  0  0  0
2  2  1  0

In [21]:
# modular division
# returns the remainder
df1.mod(df2)

   0  1  2
0  2  1  0
1  1  4  2
2  0  1  5

In [22]:
# pow() function to a dataframe
df1.pow(df2)

   0       1      2
0  8       9   3125
1  1   65536     16
2  2  117649  78125

1. The lt() function is one of the binary relational operations supported by the pandas DataFrame class.
2. After performing an element-wise comparison of two pandas DataFrame instances, the ``lt()`` method returns a DataFrame which has the comparison results as Boolean values.
3. A value in the resultant DataFrame is True, if the element of the first DataFrame is less than the element of the second DataFrame. Otherwise the value is False.

In [23]:
# lt() function
df1.lt(df2)

       0      1      2
0   True  False  False
1   True   True   True
2  False  False   True

|Binary Operation Name/DataFrame method Name| |Description|
|--------------------------------------------|---|---------|
|eq()|  |Equal To|
|neq()|  |Not Equal To|
|lt()|  |Less Than|
|le()|  |Less Than or Equal To|
|gt()|  |Greater Than|
|ge()|  |Greater Than or Equal To|